# Get data (OPTIONNAL)

For a better response time.

In [3]:
!wget https://d37ci6vzurychx.cloudfront.net/trip-data/yellow_tripdata_2014-01.parquet

--2023-07-18 10:58:12--  https://d37ci6vzurychx.cloudfront.net/trip-data/yellow_tripdata_2014-01.parquet
Resolving d37ci6vzurychx.cloudfront.net (d37ci6vzurychx.cloudfront.net)... 18.155.128.6, 18.155.128.46, 18.155.128.187, ...
Connecting to d37ci6vzurychx.cloudfront.net (d37ci6vzurychx.cloudfront.net)|18.155.128.6|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 171982098 (164M) [application/x-www-form-urlencoded]
Saving to: ‘yellow_tripdata_2014-01.parquet’

yellow_tripdata_201 100%[===================>] 164.01M  40.2MB/s    in 4.7s

2023-07-18 10:58:18 (34.9 MB/s) - ‘yellow_tripdata_2014-01.parquet’ saved [171982098/171982098]

# Read Data

In [9]:
import pandas as pd

taxi = pd.read_parquet("https://d37ci6vzurychx.cloudfront.net/trip-data/yellow_tripdata_2014-01.parquet")
print(taxi.shape)
taxi.head()

(13782517, 19)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,airport_fee
0,2,2014-01-01 00:02:00,2014-01-01 00:04:00,6,0.0,1,None,146,146,1,3.5,0.5,0.5,0.02,0.0,0.0,4.52,NaN,None
1,2,2014-01-01 00:06:00,2014-01-01 00:09:00,5,0.0,1,None,146,146,1,3.5,0.5,0.5,0.05,0.0,0.0,4.55,NaN,None
2,2,2014-01-01 00:10:00,2014-01-01 00:13:00,5,0.0,1,None,146,146,1,3.5,0.5,0.5,0.08,0.0,0.0,4.58,NaN,None
3,2,2014-01-01 00:54:00,2014-01-01 00:55:00,5,0.0,1,None,264,264,2,2.5,0.5,0.5,0.00,0.0,0.0,3.50,NaN,None
4,1,2014-01-01 00:29:18,2014-01-01 00:35:13,2,1.8,1,N,229,262,2,7.5,0.5,0.5,0.00,0.0,0.0,8.50,NaN,None

# Get the schema

Parquet type is super useful since we directly have the type of each column.

In [8]:
print(pd.io.sql.get_schema(taxi, name= "yellow_taxi_data"))

CREATE TABLE "yellow_taxi_data" (
"VendorID" INTEGER,
  "tpep_pickup_datetime" TIMESTAMP,
  "tpep_dropoff_datetime" TIMESTAMP,
  "passenger_count" INTEGER,
  "trip_distance" REAL,
  "RatecodeID" INTEGER,
  "store_and_fwd_flag" TEXT,
  "PULocationID" INTEGER,
  "DOLocationID" INTEGER,
  "payment_type" INTEGER,
  "fare_amount" REAL,
  "extra" REAL,
  "mta_tax" REAL,
  "tip_amount" REAL,
  "tolls_amount" REAL,
  "improvement_surcharge" REAL,
  "total_amount" REAL,
  "congestion_surcharge" REAL,
  "airport_fee" TEXT
)

# Create a connection to postgress

## Load SQLAlchemy

Only for a better experience with SQL like syntax

In [10]:
%load_ext sql

## Create the connection string

In [12]:
# to export db + data: pg_dump -U gitpod -h localhost pagila >> sqlfile.sql
DB_ENDPOINT = 'localhost' #"127.0.0.1"
DB = 'ny_taxi'
DB_USER = 'username'
DB_PASSWORD = 'password'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://username:password@localhost:5432/ny_taxi

## Test the connection

In [13]:
from sqlalchemy import create_engine
engine = create_engine(conn_string)

To specify the DDL for later use

In [15]:
print(pd.io.sql.get_schema(taxi, name= "yellow_taxi_data", con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" BIGINT,
	tpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	tpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	"RatecodeID" BIGINT,
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53),
	airport_fee TEXT
)

## Get a piece of data

In [14]:
taxi_10000 = taxi[:10000]
taxi_10000.shape

(10000, 19)

## Create the table schema

In [16]:
# create the columns names
taxi_10000.head(n=0).to_sql(name="yellow_taxi_data", con=engine, if_exists='replace')

0

Now if you go to `pgcli` console and execute `\dt` command, you will see that a table have been inserted.
To have a description of the table, you can use the command `\d yellow_taxi_data`

In [23]:
query = """
SELECT 1 as number
"""
pd.read_sql(query, con=engine)

   number
0       1

## Insert data

In [17]:
# insert rows"
%time taxi_10000.to_sql(name="yellow_taxi_data", con=engine, if_exists='replace') # you may want to use append instead

CPU times: user 1.44 s, sys: 43 ms, total: 1.48 s
Wall time: 2.39 s

1000

### Connection using SQL alchemy

In [19]:
%sql $conn_string

### List all the tables

In [20]:
%%sql
SELECT table_schema , table_name 
FROM information_schema.tables
WHERE table_schema not in ('information_schema', 'pg_catalog')
			AND table_type = 'BASE TABLE'
ORDER BY table_schema, table_name

 * postgresql://username:***@localhost:5432/ny_taxi
1 rows affected.

[('public', 'yellow_taxi_data')]

### Count the numbers of inserted rows

In [21]:
%%sql
SELECT count(*)
FROM yellow_taxi_data

 * postgresql://username:***@localhost:5432/ny_taxi
1 rows affected.

[(10000,)]

In [22]:
%%sql
SELECT *
FROM yellow_taxi_data
LIMIT 3

 * postgresql://username:***@localhost:5432/ny_taxi
3 rows affected.

[(0, 2, datetime.datetime(2014, 1, 1, 0, 2), datetime.datetime(2014, 1, 1, 0, 4), 6, 0.0, 1, None, 146, 146, 1, 3.5, 0.5, 0.5, 0.02, 0.0, 0.0, 4.52, None, None),
 (1, 2, datetime.datetime(2014, 1, 1, 0, 6), datetime.datetime(2014, 1, 1, 0, 9), 5, 0.0, 1, None, 146, 146, 1, 3.5, 0.5, 0.5, 0.05, 0.0, 0.0, 4.55, None, None),
 (2, 2, datetime.datetime(2014, 1, 1, 0, 10), datetime.datetime(2014, 1, 1, 0, 13), 5, 0.0, 1, None, 146, 146, 1, 3.5, 0.5, 0.5, 0.08, 0.0, 0.0, 4.58, None, None)]

# Challenge

Write a piece of code to insert all the rows in the database. You could use this boiler plate:

```py
chunksize = 1000
for i in range(0, len(df), chunksize):
    chunk = df[i:i+chunksize]
    # insert chunk into database

```

# Conclusion

In this Notebook, we used `Docker` to run a relationnal database to insert Taxi data.
We used `pgcli` client to interact with the data but there are better alternatives like `pgAdmin`.

We also used psycopg2 to interact with the data using our jupyter nOtebook. I believe the latter is better for developper when experimenting.

# Mongo

In [24]:
from pymongo import MongoClient

# Connect to MongoDB
client = MongoClient('mongodb://admin:password@localhost:27017/')
db = client['sampledb']
collection = db['samplecollection']

In [25]:
# Insert sample data
sample_data = [
    {"name": "John", "age": 25},
    {"name": "Jane", "age": 30},
    {"name": "Bob", "age": 35}
]
result = collection.insert_many(sample_data)
print("Sample data inserted successfully")

Sample data inserted successfully

In [26]:
# Query the collection
documents = collection.find({})
print("Documents in the collection:")
for document in documents:
    print(document)

client.close()

Documents in the collection:
{'_id': ObjectId('64b68384065494feadbe0a4f'), 'name': 'John', 'age': 25}
{'_id': ObjectId('64b68384065494feadbe0a50'), 'name': 'Jane', 'age': 30}
{'_id': ObjectId('64b68384065494feadbe0a51'), 'name': 'Bob', 'age': 35}